Revit 2026 API

# OpeningBoundaryRect Property

---

Retrieves the geometry information if the opening boundary is a rect.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<XYZ> BoundaryRect { get; }
```
```vb
Public ReadOnly Property BoundaryRect As IList(Of XYZ)
	Get
```
```cpp
public:
property IList<XYZ^>^ BoundaryRect {
	IList<XYZ^>^ get ();
}
```
```fsharp
member BoundaryRect : IList<XYZ> with get
```

#### Property Value

IListXYZ

If IsRectBoundary is false, this value is .

#### Reference

Opening Class

Autodesk.Revit.DB Namespace